Documents/Renault_РабочийЛистКредит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_РабочийЛистКредит</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_CRM_СтатусЗаявокНаКредит</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Renault_События</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьАвтомобиля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеАнкетыФизЛица</Name>
					<Comment>Структура (СтрокаВнутр)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммерческоеПредложение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_КоммерческоеПредложение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийПричиныОтказаОтРНБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетКредита</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КредитноеПредложение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_КредитныеПредложения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальныйВзнос</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальныйВзносПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокКредита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКредита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаБанка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕжемесячныйПлатеж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаВБанк</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Renault_ЗаявкаНаКредит</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловияРасчета</Name>
							<Comment>Структура (СтрокаВнутр)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредоставленныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПредоставления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_CRM_СтатусЗаявокНаКредит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_CRM_СтатусЗаявокНаКредит</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Одобрена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_РабочийЛистКредит/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Автор.Пустая() Тогда Объект.Автор=ПараметрыСеанса.Пользователь КонецЕсли;
	Если Объект.ДилерскийЦентр.Пустая() Тогда Объект.ДилерскийЦентр=ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр КонецЕсли;
	Если Объект.Состояние.Пустая() Тогда Объект.Состояние=Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Черновик КонецЕсли;
	
	спЗакладки.Добавить("РасчетКредита");
	спЗакладки.Добавить("ЗаявкиНаКредит");
	спЗакладки.Добавить("ПредоставленныеДокументы");
	спЗакладки[0].Пометка=Истина;
	
	//УстановитьОсновнуюЗаявку();//поиск основной заявки по банку
	//УправлениеЭлементами();
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	//Заполнение(); 
	УправлениеЭлементами();
	//ЗагрузитьВнешнююКомпоненту("C:\temp\V8ADD.dll");
	Если Объект.РасчетКредита.Количество()=0 И НЕ Объект.КоммерческоеПредложение.Пустая() Тогда РасчетКредита() КонецЕсли;
КонецПроцедуры
//Процедура Заполнение()
//	Если НЕ Объект.Ссылка.Пустая() Тогда Возврат КонецЕсли;
//	Строка=Объект.РасчетКредита.Добавить();
//	Строка.Банк=Справочники.CRM_КредитныеПредложения.РНБанк();
//	ПредложениеБанка=Справочники.CRM_КредитныеПредложения.ОптимальноеПредложениеРНБанка(Объект.Модель,Объект.Версия);
//	Строка.КредитноеПредложение=ПредложениеБанка.КредитноеПредложение;
//	Строка.Срок=ПредложениеБанка.МинимальныйСрок;
//	Строка.ПервоначальныйВзнос=ПредложениеБанка.ПервоначальныйВзнос;
//	//Строка.СуммаКредита
//	//Строка.Ставка=Ставка;
//	//Строка.ЕжемесячныйПлатеж
//КонецПроцедуры	

//Процедура УстановитьОсновнуюЗаявку()
//	Запрос=Новый Запрос("Выбрать Ссылка Из Документ.Renault_ЗаявкаНаКредит ГДЕ Ссылка В(&Заявки) И БанкПредоставляющийКредит=&Банк");
//	Запрос.УстановитьПараметр("Банк",Объект.БанкПредоставляющийКредит);
//	Запрос.УстановитьПараметр("Заявки",Объект.ЗаявкиВБанк.Выгрузить().ВыгрузитьКолонку("ЗаявкаВБанк"));
//	Выборка=Запрос.Выполнить().Выбрать();
//	Выборка.Следующий();
//	ОсновнаяЗаявка=Выборка.Ссылка;
//КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи) Оповестить("ОбновитьВоронку"); Оповестить("ОбновитьСписок"); УправлениеЭлементами() КонецПроцедуры

Процедура УправлениеЭлементами()
	Элементы.кнВернутьВЗадачи.Доступность=Не Объект.Задача.Пустая() И НЕ Объект.Ссылка.Проведен И НЕ Объект.Ссылка.Пустая();
	Элементы.кнСостояние.Заголовок="Состояние:"+Символы.ПС+Объект.Состояние;
	//Элементы.ЗаголовокФормы.Заголовок="Рабочий лист кредит ("+Нрег(Объект.Состояние)+")";
	Заголовок="Рабочий лист кредит ("+Нрег(Объект.Состояние)+")";
	
	//Элементы.кнВернутьВЗадачи.Видимость=НЕ Объект.Задача.Пустая();
	
	//Элементы.Версия.СписокВыбора.ЗагрузитьЗначения(Renault_ОбщиеФункции.ВариантыКомплектаций(Объект.Автомобиль));
	
	Если Не Объект.КоммерческоеПредложение.Пустая() Тогда
		Элементы.Автомобиль.ТолькоПросмотр=Истина;
		Элементы.Версия.ТолькоПросмотр=Истина;
		Элементы.КоммерческоеПредложение.ТолькоПросмотр=Истина;
		Элементы.СтоимостьАвтомобиля.ТолькоПросмотр=Истина;
		Элементы.Клиент.ТолькоПросмотр=Истина;
	КонецЕсли;	
	
	//переключение закладки
	АктивныйЦвет=Новый Цвет(255,207,0);
	ПассивныйЦвет=Новый Цвет(189,195,206);
	Для Каждого Эл Из спЗакладки Цикл
		Элементы["кн"+Эл.Значение].ЦветФона=?(Эл.Пометка,АктивныйЦвет,ПассивныйЦвет);
		Элементы["кн"+Эл.Значение].ЦветРамки=?(Эл.Пометка,АктивныйЦвет,ПассивныйЦвет);
		Элементы[Эл.Значение].Видимость=Эл.Пометка;
	КонецЦикла;
	
	Элементы.кнОформитьЗаявку.Видимость=ИмяТЧ()<>"ПредоставленныеДокументы";
	//Элементы.кнОсновной.Доступность=ИмяТЧ()="ЗаявкиВБанк";
	
	////добавим условное оформление
	//Отбор=ЭтаФорма.УсловноеОформление.Элементы[0].Отбор.Элементы[0];
	//Отбор.ПравоеЗначение=ОсновнаяЗаявка;
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьСостояние(Состояние="")
	Если ТипЗнч(Состояние)=Тип("КомандаФормы") Тогда
		Состояния=Новый СписокЗначений;
		Для Каждого Эл Из Перечисления.Renault_CRM_СтатусЗаявокНаКредит Цикл Состояния.Добавить(Эл) КонецЦикла;	
		Состояния.НайтиПоЗначению(Объект.Состояние).Пометка=Истина;

		Парам=Новый Структура;
		Парам.Вставить("Список",Состояния);
		Парам.Вставить("Заголовок","Состояние заявки");
		Парам.Вставить("МножественныйВыбор",Ложь);
		//Парам.Вставить("КоличествоЭлементовВСтроке",3);
		Парам.Вставить("ШиринаЭлемента",14);
		Парам.Вставить("ВысотаЭлемента",2);
		Состояние=ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений",Парам,ЭтаФорма);
	КонецЕсли;
	
	Если Состояние<>Неопределено Тогда 
		СтароеСостояние=Объект.Состояние;
		Объект.Состояние=Состояние;
		Модифицированность=Истина;
		//Если НЕ ИзменитьСостояние() Тогда Объект.Состояние=СтароеСостояние КонецЕсли;
	КонецЕсли;
	УправлениеЭлементами();
КонецПроцедуры

&НаКлиенте
Процедура кнВернутьВЗадачи(Команда) Если Вопрос(НСтр("en='Return the application to the task?';ru='Вернуть заявку в задачи?'"), РежимДиалогаВопрос.ДаНет, 0)=КодВозвратаДиалога.Да Тогда ВернутьВЗадачи() КонецЕсли КонецПроцедуры 
Процедура ВернутьВЗадачи() Если Задачи.Renault_События.ОтменитьВыполнениеЗадачи(Объект.Задача) Тогда УправлениеЭлементами() КонецЕсли КонецПроцедуры

&НаКлиенте
Процедура кнопкиТЧ(Команда)
	ИмяТЧ=ИмяТЧ();
	ИмяТЧОбъекта=?(ИмяТЧ="ЗаявкиНаКредит","РасчетКредита",ИмяТЧ);
	Если ТекущийЭлемент.Имя="кнДобавить" Тогда 
		//СтрокаТЧ=Объект[ИмяТЧ].Добавить();
		Если ИмяТЧ="РасчетКредита" или ИмяТЧ="ЗаявкиНаКредит" Тогда РасчетКредита()
		ИначеЕсли ИмяТЧ="ПредоставленныеДокументы" Тогда ДобавитьДокументФизЛица()
		КонецЕсли;
	ИначеЕсли ТекущийЭлемент.Имя="кнУдалить" Тогда 
		Если Элементы[ИмяТЧ].ТекущаяСтрока=Неопределено Тогда Возврат КонецЕсли;
		ТекСтрока=Объект[ИмяТЧОбъекта].НайтиПоИдентификатору(Элементы[ИмяТЧ].ТекущаяСтрока);
		Если ТекСтрока<>Неопределено Тогда Объект[ИмяТЧОбъекта].Удалить(ТекСтрока) КонецЕсли;
	ИначеЕсли ТекущийЭлемент.Имя="кнОбновить" Тогда Элементы[ИмяТЧ].Обновить()
	ИначеЕсли ТекущийЭлемент.Имя="кнОформитьЗаявку" Тогда
		Если Элементы[ИмяТЧ].ТекущаяСтрока=Неопределено Тогда Возврат КонецЕсли;
		ЗаявкаВБанк()
	ИначеЕсли ТекущийЭлемент.Имя="кнОсновной" Тогда
		Если Элементы[ИмяТЧ].ТекущаяСтрока=Неопределено Тогда Возврат КонецЕсли;
		Для Каждого Стр Из Объект[ИмяТЧОбъекта] Цикл 
			Если Стр=Объект[ИмяТЧОбъекта].НайтиПоИдентификатору(Элементы[ИмяТЧ].ТекущаяСтрока) Тогда
				Стр.Основной=НЕ Стр.Основной
			Иначе
				Стр.Основной=Ложь
			КонецЕсли;	
		КонецЦикла;
		//СтрокаТЧ=Объект[ИмяТЧОбъекта].НайтиПоИдентификатору(Элементы[ИмяТЧ].ТекущаяСтрока);
		//СтрокаТЧ.Основной=Не СтрокаТЧ.Основной;
		//ОсновнаяЗаявка=СтрокаТЧ.ЗаявкаВБанк;
		//Объект.БанкПредоставляющийКредит=СтрокаТЧ.ЗаявкаВБанк.БанкПредоставляющийКредит;
		//Объект.КредитноеПредложение=СтрокаТЧ.ЗаявкаВБанк.КредитноеПредложение;
		//Объект.ПервоначальныйВзносПроцент=СтрокаТЧ.ЗаявкаВБанк.ПервоначальныйВзносПроцент;
		//Объект.ПервоначальныйВзнос=СтрокаТЧ.ЗаявкаВБанк.ПервоначальныйВзнос;
		//Объект.ЕжемесячныйПлатеж=СтрокаТЧ.ЗаявкаВБанк.ЕжемесячныйПлатеж;
		//Объект.Ставка=СтрокаТЧ.ЗаявкаВБанк.Ставка;
		//Объект.Срок=СтрокаТЧ.ЗаявкаВБанк.Срок;
		//Объект.Сумма=СтрокаТЧ.ЗаявкаВБанк.Сумма;
		//УправлениеЭлементами();
	КонецЕсли;	
КонецПроцедуры
Функция ИмяТЧ() Для Каждого Эл Из спЗакладки Цикл Если Эл.Пометка Тогда Возврат Эл.Значение КонецЕсли КонецЦикла КонецФункции	

&НаКлиенте
Процедура РасчетКредита(ИдСтроки=Неопределено)
	Парам=Новый Структура;
	Парам.Вставить("Клиент",Объект.Клиент);
	Парам.Вставить("Автомобиль",Объект.Автомобиль);
	Парам.Вставить("Версия",Объект.Версия);
	Парам.Вставить("ТипКП",Объект.КоммерческоеПредложение.ТипКП);
	Парам.Вставить("СтоимостьАвтомобиля",Объект.СтоимостьАвтомобиля);
	
	Если ИдСтроки<>Неопределено Тогда
		Строка=Объект.РасчетКредита.НайтиПоИдентификатору(ИдСтроки);
		//Парам.Вставить("КредитноеПредложение",Строка.КредитноеПредложение);
		//Парам.Вставить("ПервоначальныйВзнос",Строка.ПервоначальныйВзнос);
		//Парам.Вставить("ПервоначальныйВзносПроцент",Строка.ПервоначальныйВзносПроцент);
		//Парам.Вставить("СрокКредита",Строка.СрокКредита);
		//Парам.Вставить("СуммаКредита",Строка.СуммаКредита);
		//Парам.Вставить("СтавкаБанка",Строка.СтавкаБанка);
		//Парам.Вставить("ЕжемесячныйПлатеж",Строка.ЕжемесячныйПлатеж);
		Парам.Вставить("УсловияРасчета",Строка.УсловияРасчета);
	КонецЕсли;	
	
	//Данные=ОткрытьФормуМодально("Документ.Renault_РабочийЛистКредит.Форма.РасчетКредита",Парам,ЭтаФорма,УникальныйИдентификатор);
//проблемы совместимости
Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда
	Данные=ОткрытьФормуМодально("Документ.Renault_РабочийЛистКредит.Форма.РасчетКредита",Парам,ЭтаФорма);
Иначе
	Выполнить("Данные=ОткрытьФормуМодально(""Документ.Renault_РабочийЛистКредит.Форма.РасчетКредита"",Парам,ЭтаФорма,УникальныйИдентификатор)")
КонецЕсли;	
	Если Данные<>Неопределено Тогда
		Если ИдСтроки=Неопределено Тогда Строка=Объект.РасчетКредита.Добавить() КонецЕсли; // иначе строка передана в процедуру
		ЗаполнитьЗначенияСвойств(Строка,Данные);
		Строка.УсловияРасчета=ЗначениеВСтрокуВнутр(Данные);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РасчетКредитаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) РасчетКредита(Элементы.РасчетКредита.ТекущаяСтрока) КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаКредитВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) СтандартнаяОбработка=Ложь; ЗаявкаВБанк() КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаВБанк()
	Если Элементы[ИмяТЧ()].ТекущиеДанные=Неопределено  Тогда
		Сообщить("Добавьте новый расчет или выбирите существующий",СтатусСообщения.Информация);
		Возврат
	ИначеЕсли Элементы[ИмяТЧ()].ТекущиеДанные.ЗаявкаВБанк.Пустая() Тогда
	//создать новую заявку	
		Форма=ПолучитьФорму("Документ.Renault_ЗаявкаНаКредит.ФормаОбъекта");
		Форма.Объект.Автомобиль=Объект.Автомобиль;
		Форма.Объект.РабочийЛист=Объект.РабочийЛист;
		Форма.Объект.ДилерскийЦентр=Объект.ДилерскийЦентр;
		Форма.Объект.Версия=Объект.Версия;
		Форма.Объект.Клиент=Объект.Клиент;
		Форма.Объект.Состояние=Перечисления.Renault_CRM_СтатусЗаявокНаКредит.Черновик;
		Форма.Объект.СтоимостьАвтомобиля=Объект.СтоимостьАвтомобиля;
		
		Если Объект.РасчетКредита.Количество()=0 Тогда
			Строка=Объект.РасчетКредита.Добавить();
		Иначе
			Строка=Объект.РасчетКредита.НайтиПоИдентификатору(Элементы[ИмяТЧ()].ТекущиеДанные.ПолучитьИдентификатор());
			Форма.Объект.Банк=Строка.КредитноеПредложение.Владелец;
			Форма.Объект.КредитноеПредложение=Строка.КредитноеПредложение;
			Форма.Объект.СтавкаБанка=Строка.СтавкаБанка;
			Форма.Объект.СрокКредита=Строка.СрокКредита;
			Форма.Объект.ПервоначальныйВзносПроцент=Строка.ПервоначальныйВзносПроцент;
			Форма.Объект.ПервоначальныйВзнос=Строка.ПервоначальныйВзнос;
			Форма.Объект.СуммаКредита=Строка.СуммаКредита;
			Форма.Объект.ЕжемесячныйПлатеж=Строка.ЕжемесячныйПлатеж;
		КонецЕсли;	
		
		Форма.ОткрытьМодально();
		Если НЕ Форма.Объект.Ссылка.Пустая() Тогда
			Строка.ЗаявкаВБанк=Форма.Объект.Ссылка;
			Записать();
		КонецЕсли;	
	ИначеЕсли НЕ Элементы[ИмяТЧ()].ТекущиеДанные.ЗаявкаВБанк.Пустая() Тогда
	//открыть существующую заявку	
		ОткрытьФорму("Документ.Renault_ЗаявкаНаКредит.ФормаОбъекта",Новый Структура("Ключ",Элементы[ИмяТЧ()].ТекущиеДанные.ЗаявкаВБанк),ЭтаФорма,УникальныйИдентификатор)	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура кнЗакладка(Команда) //переключение закладок
	Для Каждого Эл Из спЗакладки Цикл Эл.Пометка=Найти(ТекущийЭлемент.Имя,Эл.Значение)>0 КонецЦикла; //пометка текущей закладки в списке
	УправлениеЭлементами();
КонецПроцедуры

&НаКлиенте
Процедура РабочийЛистНажатие(Элемент, СтандартнаяОбработка) СтандартнаяОбработка=Ложь; Renault_CRM.ОткрытьФормуРЛ(Объект.РабочийЛист) КонецПроцедуры

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	Если ТипЗнч(Объект.Автомобиль)<>Тип("СправочникСсылка.Модели") Тогда Объект.Версия="" КонецЕсли;
	УправлениеЭлементами() 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДокументФизЛица()
	
	Сп=Новый СписокЗначений;
	Сп.Добавить("АнкетаФизЛица","Анкета физ. лица",Объект.ДанныеАнкетыФизЛица<>"",БиблиотекаКартинок.Renault_Client_New);
	Сп.Добавить("Паспорт","Паспорт");
	Сп.Добавить("ВодительскоеУдостоверение","Водительское удостоверение");
	Сп.Добавить("Прочее","Прочее");
	Сп.Добавить("Выбрать","Выбрать существующий",Истина);
	
	Парам=Новый Структура;
	Парам.Вставить("Список",Сп);
	Парам.Вставить("Заголовок","Документы физического лица для предоставления в банк");
	Парам.Вставить("МножественныйВыбор",Ложь);
	Парам.Вставить("КоличествоЭлементовВСтроке",5); //если не задать - вычислит автоматически соотношением сторон 3:2
	Парам.Вставить("ШиринаЭлемента",14);
	Парам.Вставить("ВысотаЭлемента",2);
	ВыбДок=ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений",Парам,ЭтаФорма);
	Если ВыбДок<>Неопределено Тогда 
		Модифицированность=Истина;
		
		Если ВыбДок="Выбрать" Тогда
		//выбрать существующий документ			
			ФормаПодбора=ПолучитьФорму("Справочник.ПодтверждающиеДокументы.ФормаВыбора",,ЭтаФорма,УникальныйИдентификатор);
			ФормаПодбора.Отбор.Владелец.Значение=Объект.Клиент;
			ФормаПодбора.Отбор.Владелец.Использование=Истина;
			ФормаПодбора.Отбор.Владелец.ВидСравнения=ВидСравнения.Равно;
			ПодтверждающийДокумент=ФормаПодбора.ОткрытьМодально();
		Иначе //создать новый
			ПодтверждающийДокумент=ДокументФизЛица(ВыбДок);	
		КонецЕсли;	
		
		Если Объект.ПредоставленныеДокументы.НайтиСтроки(Новый Структура("Документ",ПодтверждающийДокумент)).Количество()=0 Тогда
			Строка=Объект.ПредоставленныеДокументы.Добавить();
			Строка.ДатаПредоставления=ТекущаяДата();
			Строка.Документ=ПодтверждающийДокумент;
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ВыбДок="АнкетаФизЛица" Тогда
		
		//данные анкеты - ЗначениеВСтрокуВнутр(Структура), новая структура или реквизит ДанныеАнкетыФизЛица
		Если Объект.ДанныеАнкетыФизЛица<>"" Тогда
			Парам=Новый Структура("ДанныеАнкеты",Объект.ДанныеАнкетыФизЛица);
		Иначе
			Структура=Новый Структура;
			//фио
			Структура.Вставить("Имя",Объект.Клиент.Имя);
			Структура.Вставить("Фамилия",Объект.Клиент.Фамилия);
			Структура.Вставить("Отчество",Объект.Клиент.Отчество);
			Структура.Вставить("ДатаРождения",Объект.Клиент.ДатаРождения);
			
			//паспорт
			Структура.Вставить("ДокументУдостоверяющийЛичность","паспорт гражданина РФ");
			Паспорт=НайтиПаспорт(Объект.Клиент);
			Если ЗначениеЗаполнено(Паспорт) Тогда
				Структура.Вставить("СерияДокУЛ",Паспорт.Серия);
				Структура.Вставить("НомерДокУЛ",Паспорт.Номер);
				Структура.Вставить("ДатаВыдачиДокУЛ",Паспорт.ДатаВыдачи);
				Структура.Вставить("ВыданДокУЛ",Паспорт.КемВыдан);
			КонецЕсли;
			
			//контакты
			Контакты=Контакты(Объект.Клиент);
			Пока Контакты.Следующий() Цикл
				Если Контакты.Тип=Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					Если Контакты.Вид=Справочники.ВидыКонтактнойИнформации.ТелефонСотовый Тогда
						Структура.Вставить("МобильныйТелефон",Контакты.Представление);
					ИначеЕсли Контакты.Вид=Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный Тогда
						Структура.Вставить("ДополнительныйТелефон",Контакты.Представление);
					ИначеЕсли Контакты.Вид=Справочники.ВидыКонтактнойИнформации.ТелефонРабочий Тогда
						Структура.Вставить("РабочийТелефон",Лев(Контакты.Представление,10));
						Структура.Вставить("ДобавочныйТелефон",Сред(Контакты.Представление,11));
					ИначеЕсли Контакты.Вид=Справочники.ВидыКонтактнойИнформации.ТелефонДомашний Тогда
						Структура.Вставить("ТелефонПоАдресуПроживания",Контакты.Представление);
					ИначеЕсли Контакты.Вид=Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний ИЛИ Контакты.Вид=Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий Тогда
						Структура.Вставить("ТелефонПоАдресуПроживания",Контакты.Представление);
					Иначе
						Структура.Вставить("Email",Контакты.Представление);
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;
			
			Парам=Новый Структура("ДанныеАнкеты",ЗначениеВСтрокуВнутр(Структура));
		КонецЕсли;
		
		Парам.Вставить("ПодтверждающийДокумент",ПодтверждающийДокумент);
		
//проблемы совместимости		
		//Оповещение=Новый ОписаниеОповещения("СохранитьДанныеАнкеты",ЭтаФорма);
		//ОткрытьФорму("Документ.Renault_РабочийЛистКредит.Форма.АнкетаФизЛица2016",Парам,ЭтаФорма,УникальныйИдентификатор,,,Оповещение);
		
		Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда
			ОткрытьФорму("Документ.Renault_РабочийЛистКредит.Форма.АнкетаФизЛица2016",Парам,ЭтаФорма);
		Иначе
			Выполнить("
|			Оповещение=Новый ОписаниеОповещения(""СохранитьДанныеАнкеты"",ЭтаФорма);
|			ОткрытьФорму(""Документ.Renault_РабочийЛистКредит.Форма.АнкетаФизЛица2016"",Парам,ЭтаФорма,УникальныйИдентификатор,,,Оповещение);
			|")
		КонецЕсли;	
		
	ИначеЕсли ПодтверждающийДокумент<>Неопределено Тогда 
		ОткрытьЗначение(ПодтверждающийДокумент)		
	КонецЕсли;	
	
	//Анкета=ПолучитьАнкету();
	//ИмяФайла=ПолучитьИмяВременногоФайла("pdf");
	//Анкета.Записать(ИмяФайла);
	//
	//Форма=ПолучитьФорму("Документ.Renault_РабочийЛистКредит.Форма.Acrobat");
	//Форма.ОткрытьФайл(ИмяФайла);
	//Форма.Открыть();
	
	//ЗапуститьПриложение(ИмяФайла);
	
	//Acrobat=Новый COMОбъект("AcroPDF.PDF.1");
	//Acrobat.Visible=true;
	//Acrobat.LoadFile(ИмяФайла);
	//Возврат;
	
	//V8ADD=Новый("Addin.FileWatch");
	
КонецПроцедуры	
Функция ДокументФизЛица(ВидДокумента)
	
	Если ВидДокумента="Паспорт" Тогда
		ВидДок=Перечисления.ВидыДокументов.Паспорт;
		НаименованиеДок="Паспорт";
	ИначеЕсли ВидДокумента="ВодительскоеУдостоверение" Тогда
		ВидДок=Перечисления.ВидыДокументов.Удостоверение;
		НаименованиеДок="Удостоверение";
	ИначеЕсли ВидДокумента="АнкетаФизЛица" Тогда
		ВидДок=Перечисления.ВидыДокументов.Прочее;
		НаименованиеДок="Анкета физ. лица";
	Иначе
		ВидДок=Перечисления.ВидыДокументов.Прочее;
		НаименованиеДок=ВидДокумента;
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="Выбрать Первые 1 Ссылка Из Справочник.ПодтверждающиеДокументы ГДЕ Владелец=&Владелец И Не Устаревший И ВидПодтверждающегоДокумента=&ВидДок И Не ПометкаУдаления И Наименование Подобно &Наименование Упорядочить По ДатаВыдачи Убыв";
	Запрос.УстановитьПараметр("Владелец",Объект.Клиент);
	Запрос.УстановитьПараметр("ВидДок",ВидДок);
	Запрос.УстановитьПараметр("Наименование",НаименованиеДок);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СпрДок=Выборка.Ссылка
	Иначе
		СпрДок=Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
		СпрДок.Владелец=Объект.Клиент;
		СпрДок.ВидПодтверждающегоДокумента=ВидДок;
		СпрДок.Наименование=НаименованиеДок;
		СпрДок.ДатаВыдачи=ТекущаяДата();
		СпрДок.Номер="б/н";
		СпрДок.Серия="б/с";
		СпрДок.Записать();
	КонецЕсли;	
	
	Возврат СпрДок.Ссылка
КонецФункции	

Функция ПолучитьАнкету()
//	Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайла));
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет("АнкетаФизлица")
КонецФункции	
Процедура СохранитьДанныеАнкеты(Данные,Параметр) Если Данные<>"" Или Данные<>Неопределено Тогда Объект.ДанныеАнкетыФизЛица=Данные КонецЕсли КонецПроцедуры	

Функция НайтиПаспорт(Физик)
	Запрос=Новый Запрос("Выбрать Первые 1 Ссылка Из Справочник.ПодтверждающиеДокументы ГДЕ Владелец=&Физик И ВидПодтверждающегоДокумента=Значение(Перечисление.ВидыДокументов.Паспорт)
	|	И (ДатаОкончания=ДатаВремя(1,1,1,0,0,0) ИЛИ ДатаОкончания>&ТекДата) 
	|");
	Запрос.УстановитьПараметр("Физик",Физик);
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	Выборка=Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка
КонецФункции	
&НаКлиенте
Функция Контакты(Физик)
	Запрос=Новый Запрос("Выбрать * Из РегистрСведений.КонтактнаяИнформация ГДЕ Объект=&Физик");
	Запрос.УстановитьПараметр("Физик",Физик);
	Возврат Запрос.Выполнить().Выбрать()
КонецФункции

&НаКлиенте
Процедура КоммерческоеПредложениеНажатие(Элемент, СтандартнаяОбработка) СтандартнаяОбработка=Ложь; Документы.CRM_КоммерческоеПредложение.Открыть(Объект.РабочийЛист,Объект.Клиент,Объект.КоммерческоеПредложение) КонецПроцедуры
